app/views/users/edit.html.erb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MyString"], ["email", "MyString"], ["created_at", "2020-10-20 06:53:56.260363"], ["updated_at", "2020-10-20 06:53:56.260363"]]
---
      <%= f.password_field :password_confirmation, class: "form-control" %>
      <%= f.submit t("user.save"), class: "btn btn-primary" %>