app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<% provide(:title, (t"user.all")) %>
<h1><%= t "user.all" %></h1>