app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def show
    @user = User.find_by id: params[:id]

SELECT "users".* FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: Settings.paging.p10)

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "AV"], ["email", "nhockcukuin@gmai.com"], ["created_at", "2020-10-20 01:45:10.948487"], ["updated_at", "2020-10-20 01:45:10.948487"]]
---
  def create
    @user = User.new user_params
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_by(id: params[:id])