app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]
---
  def destroy
    if @user.destroy